Revit 2027 API
BoundaryConditionsOrientTo Enumeration
 Specifies boundary condition orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BoundaryConditionsOrientTo
Public Enumeration BoundaryConditionsOrientTo
public enum class BoundaryConditionsOrientTo
type BoundaryConditionsOrientTo
Members
Member name | Value | Description
HostLocalCoordinateSystem | 1 |  Boundary condition is oriented in respect to it analytical host element coordinate system and will follow host changes.
Project | 0 |  Boundary condition is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace